#pragma once

#include <vector>
#include <span>

#include <eigen3/Eigen/Dense>

/*
    РџРѕСЃС‚СЂРѕРµРЅРёРµ РІС‹РїСѓРєР»РѕР№ РѕР±РѕР»РѕС‡РєРё РІ 2D.
    Р’РѕР·РІСЂР°С‰Р°РµС‚:
      - РїСѓСЃС‚РѕР№ РјР°СЃСЃРёРІ, РµСЃР»Рё РїРµСЂРµРґР°РЅ РїСѓСЃС‚РѕР№ РјР°СЃСЃРёРІ
      - РјР°СЃСЃРёРІ РёР· РѕРґРЅРѕРіРѕ СЌР»РµРјРµРЅС‚Р°, РµСЃР»Рё РѕР±РѕР»РѕС‡РєР° РІС‹СЂРѕР¶РґР°РµС‚СЃСЏ РІ С‚РѕС‡РєСѓ
      - РјР°СЃСЃРёРІ РёР· РґРІСѓС… СЌР»РµРјРµРЅС‚РѕРІ, РµСЃР»Рё РѕР±РѕР»РѕС‡РєР° РІС‹СЂРѕР¶РґР°РµС‚СЃСЏ РІ РїСЂСЏРјСѓСЋ
      - РІС‹РїСѓРєР»СѓСЋ РѕР±РѕР»РѕС‡РєСѓ РІ "СЃС‚Р°РЅРґР°СЂС‚РЅС‹С…" СЃРёС‚СѓР°С†РёСЏС…
*/
std::vector<Eigen::Vector2d> convexHull(std::span<const Eigen::Vector2d> points);
